#include "Picture.h"
#include "Primitives.h"

// При резайзе уменьшать картинку
void Picture::Draw()
{
	// Тело
	DrawElliplse({ 400, 300 }, 100, 100, { 0.65, 0.34, 0 });
	// Шляпа
	DrawRectangle({ 300, 160 }, 200, 40, { 1.0, 1.0, 0.0 });
	DrawRectangle({ 360, 130 }, 80, 30, { 1.0, 1.0, 0.0 });
	// Глаза
	DrawElliplse({ 370, 255 }, 30, 30, { 1, 1, 1 });
	DrawElliplse({ 370, 255 }, 5, 5, { 0, 0, 0 });
	DrawElliplse({ 430, 255 }, 30, 30, { 1, 1, 1 });
	DrawElliplse({ 430, 255 }, 5, 5, { 0, 0, 0 });
	// Уши
	DrawElliplse({ 480, 220 }, 15, 15, { 0.65, 0.34, 0 });
	DrawElliplse({ 320, 220 }, 15, 15, { 0.65, 0.34, 0 });
	// Нос
	DrawElliplse({ 400, 300 }, 32, 20, { 0.74, 0.45, 0.13 });
	// Рот
	DrawElliplse({ 400, 330 }, 17, 17, { 0.96, 0.29, 0.15 }, 0, M_PI);
	// Руки
	DrawElliplse({ 280, 340 }, 30, 25, { 0.65, 0.34, 0 }, 3 * M_PI / 4, 7 * M_PI / 4);
	DrawElliplse({ 520, 340 }, 30, 25, { 0.65, 0.34, 0 }, 5 * M_PI / 4, 9 * M_PI / 4);
	// Ноги
	DrawElliplse({ 360, 420 }, 30, 25, { 0.65, 0.34, 0 }, M_PI);
	DrawElliplse({ 440, 420 }, 30, 25, { 0.65, 0.34, 0 }, M_PI);
	return;

	// Шляпа
	DrawElliplse({ 400, 180 }, 55, 23, { 0.81, 0.435, 0.1 });
	DrawElliplse({ 400, 180 }, 50, 18, { 0.94, 0.61, 0.07 });

	DrawElliplse({ 400, 205 }, 90, 30, { 0.81, 0.435, 0.1 });
	DrawElliplse({ 400, 205 }, 85, 25, { 0.94, 0.61, 0.07 });

	// Ноги
	DrawElliplse({ 420, 420 }, 20, 30, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 431, 430 }, 30, 20, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 420, 420 }, 16, 26, { 0.89, 0.41, 0.07 });
	DrawElliplse({ 431, 430 }, 26, 16, { 0.89, 0.41, 0.07 });

	DrawElliplse({ 380, 420 }, 20, 30, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 369, 430 }, 30, 20, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 380, 420 }, 16, 26, { 0.89, 0.41, 0.07 });
	DrawElliplse({ 369, 430 }, 26, 16, { 0.89, 0.41, 0.07 });

	// Тело и Ушли
	DrawElliplse({ 400, 300 }, 105, 105, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 450, 205 }, 10, 10, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 350, 205 }, 10, 10, { 0.58, 0.23, 0.168 });

	DrawElliplse({ 400, 300 }, 100, 100, { 0.89, 0.41, 0.07 });
	DrawElliplse({ 450, 205 }, 5, 5, { 0.89, 0.41, 0.07 });
	DrawElliplse({ 350, 205 }, 5, 5, { 0.89, 0.41, 0.07 });

	DrawTriangle({ 450, 205 }, { 430, 215 }, { 470, 240 }, { 0.89, 0.41, 0.07 });
	DrawTriangle({ 350, 205 }, { 370, 215 }, { 330, 240 }, { 0.89, 0.41, 0.07 });

	// Рот
	DrawElliplse({ 400, 300 }, 25, 20, { 0.37, 0.21, 0.17 });
	DrawElliplse({ 400, 295 }, 28, 20, { 0.89, 0.41, 0.07 });

	// Брови
	DrawQuadrilateral({ 412, 213 }, { 410, 225 }, { 446, 220 }, { 445, 232 }, { 0.37, 0.21, 0.17 });
	DrawQuadrilateral({ 388, 213 }, { 390, 225 }, { 354, 220 }, { 353, 232 }, { 0.37, 0.21, 0.17 });

	// Глаза
	DrawElliplse({ 375, 260 }, 30, 30, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 425, 260 }, 30, 30, { 0.58, 0.23, 0.168 });

	DrawElliplse({ 375, 260 }, 27, 27, { 1, 1, 1 });
	DrawElliplse({ 425, 260 }, 27, 27, { 1, 1, 1 });

	DrawElliplse({ 387, 260 }, 7, 10, { 0, 0, 0 });
	DrawElliplse({ 413, 260 }, 7, 10, { 0, 0, 0 });

	DrawElliplse({ 392, 256 }, 2, 3, { 1, 1, 1 });
	DrawElliplse({ 418, 256 }, 2, 3, { 1, 1, 1 });

	DrawRectangle({ 398, 245 }, 3, 30, { 0.58, 0.23, 0.168 });

	// Нос
	DrawElliplse({ 400, 285 }, 25, 20, { 0.37, 0.21, 0.17 });

	// Щеки
	DrawElliplse({ 350, 300 }, 35, 27, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 340, 302 }, 40, 27, { 0.89, 0.41, 0.07 });

	DrawElliplse({ 450, 300 }, 35, 27, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 460, 302 }, 40, 27, { 0.89, 0.41, 0.07 });

	// Руки
	DrawElliplse({ 515, 320 }, 15, 25, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 515, 350 }, 15, 15, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 515, 320 }, 13, 23, { 0.89, 0.41, 0.07 });
	DrawElliplse({ 515, 350 }, 13, 13, { 0.89, 0.41, 0.07 });

	DrawElliplse({ 285, 320 }, 15, 25, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 285, 350 }, 15, 15, { 0.58, 0.23, 0.168 });
	DrawElliplse({ 285, 320 }, 13, 23, { 0.89, 0.41, 0.07 });
	DrawElliplse({ 285, 350 }, 13, 13, { 0.89, 0.41, 0.07 });
}
namespace
{
	void DrawKopatych()
	{

	}
}